Repository: NickYeoh/MyTime-KBS
Catalog: MyTime/Resource.*.resx
Languages: ms_my

source: Absent
ms_my: Tidak Hadir

source: Cancel
ms_my: Batal

source: Close
ms_my: Tutup

# Create
source: New
ms_my: Baru

source: Date
ms_my: Tarikh

source: Day
ms_my: Hari

# Day.Fri
source: Friday
ms_my: Jumaat

# Day.Mon
source: Monday
ms_my: Isnin

# Day.Sat
source: Saturday
ms_my: Sabtu

# Day.Sun
source: Sunday
ms_my: Ahad

# Day.Thu
source: Thursday
ms_my: Khamis

# Day.Tues
source: Tuesday
ms_my: Selasa

# Day.Wed
source: Wednesday
ms_my: Rabu

source: Delete
ms_my: Padam

source: Department
ms_my: Bahagian

# DepartmentID
source: Department Code
ms_my: Kod Bahagian

# DepartmentIDDuplicated
source: Department Code is duplicated
ms_my: Kod Bahagian sudah wujuh

# DepartmentIDRequired
source: Please input Department Code
ms_my: Sila masuk Kod Bahagian

source: Department List
ms_my: Senarai Bahagian

# DepartmentName
source: Department
ms_my: Bahagian

# DepartmentNameDuplicated
source: Department is duplicated
ms_my: Bahagian sudah wujuh

# DepartmentNameRequired
source: Please input Department
ms_my: Sila masuk Bahagian

# DepartmentNameRequiredForList
source: Please select Department
ms_my: Sila pilih Bahagian

source: Early Out
ms_my: Balik Awal

source: Email
ms_my: Emel

# EmailRequired
source: Please input Email
ms_my: Sila input Emel

source: End On
ms_my: Berakhir Pada

source: Grade
ms_my: Gred

source: Holiday
ms_my: Cuti Umum

source: Holiday List
ms_my: Senarai Cuti Umum

# HolidayName
source: Holiday
ms_my: Cuti Umum

# HolidayNameRequired
source: Please input Holiday
ms_my: Sila masuk Cuti Umum

source: Home
ms_my: Utama

source: Invalid Email
ms_my: Emel tidah sah

source: Invalid Name
ms_my: Nama tidak sah

source: Invalid Password
ms_my: Kata Laluan tidak sah

# IsActivated
source: Activated
ms_my: Diaktifkan

source: Language
ms_my: Bahasa

source: Late In
ms_my: Lewat Masuk

source: Late In / Early Out
ms_my: Lewat Masuk / Balik Awal

source: List
ms_my: Senarai

source: Login
ms_my: Log Masuk

source: Logout
ms_my: Log Keluar

# MaxLenExceeded
source: {0} has excceded {1} characters limit
ms_my: {0} telah melebihi had {1} perkataan

# MessageError
source: Error Message
ms_my: Mesej Lalat

# MessageInfo
source: Information Message
ms_my: Mesej Maklumat

# MessageSuccessCreate
source: New record is successfully saved
ms_my: Rekod baru telah berjaya disimpan

# MessageSuccessDelete
source: Record is successfully deleted
ms_my: Rekod telah berjaya dipadam

# MessageSuccessUpdate
source: Record is successfully updated
ms_my: Rekod telah berjaya dikemaskini

source: Month
ms_my: Bulan

source: No
ms_my: Tidak

source: NRIC
ms_my: No Kad Pengenalan

# NRICRequired
source: Please input NRIC
ms_my: Sila masuk No Kad Pengenalan

source: On Leave
ms_my: Cuti

source: Password
ms_my: Kata Laluan

# PasswordRequired
source: Please input Password
ms_my: Sila masuk Kata Laluan

source: Please select
ms_my: Sila pilih

source: Reason
ms_my: Alasan

source: Reason for
ms_my: Alasan Untuk

source: Reason ID
ms_my: Kod Alasan

# ReasonIDDuplicated
source: Reason ID is duplicated
ms_my: Kod Alasan sudah wujuh

# ReasonIDRequired
source: Reason ID is required
ms_my: Sila masuk Kod Alasan

source: Reason List
ms_my: Senarai Alasan

# ReasonName
source: Reason
ms_my: Alasan

# ReasonNameDuplicated
source: Reason is duplicated
ms_my: Alasan sudah wujuh

# ReasonNameRequired
source: Reason is required
ms_my: Sila masuk Alasan

# ReasonNameRequiredForList
source: Please select Reason
ms_my: Sila pilih Alasan

# Role
source: User Role
ms_my: Peranan Pengguna

# RoleID
source: User Role ID
ms_my: ID Peranan Pengguna

# RoleIDRequired
source: Please input User Role ID
ms_my: Sila masuk ID Peranan Pengguna

# RoleList
source: User Role List
ms_my: Senarai Peranan Pengguna

# RoleName
source: User Role
ms_my: Peranan Pengguna

# RoleNameDuplicated
source: User Role is duplicated
ms_my: Peranan Pengguna sudah wujuh

# RoleNameRequired
source: Please input User Role
ms_my: Sila masuk Peranan Pengguna

source: Save
ms_my: Simpan

# ShiftID
source: Work Hour ID
ms_my: Kod Waktu Kerja

# ShiftIDDuplicated
source: Work Hour ID is duplicated
ms_my: Kod Waktu Kerja sudah wujuh

# ShiftIDRequired
source: Please input Work Hour ID
ms_my: Sila masuk Kod Waktu Kerja

# ShiftList
source: Work Hour List
ms_my: Senarai Waktu Kerja

# ShiftName
source: Work Hour
ms_my: Waktu Kerja

# ShiftNameDuplicated
source: Work Hour is duplicated
ms_my: Waktu Kerja sudah wujuh

# ShiftNameRequired
source: Please input Work Hour
ms_my: Sila masuk Waktu Kerja

source: Start On
ms_my: Bermula Pada

source: Submit
ms_my: Hantar

source: System Setting
ms_my: Tetapan Sistem

# TimeIn
source: Time In Start
ms_my: Waktu Masuk

source: Time Out
ms_my: Waktu Keluar

source: Unit ID
ms_my: Kod Unit

# UnitIDDuplicated
source: Unit ID is duplicated
ms_my: Kod Unit sudah wujuh

# UnitIDRequired
source: Please input Unit ID
ms_my: Sila masuk Kod Unit

source: Unit List
ms_my: Senarai Unit

# UnitNameDuplicated
source: Unit is duplicated
ms_my: Unit sudah wujuh

# UnitNameRequired
source: Please input Unit
ms_my: Sila masuk Unit

source: Update
ms_my: Kemaskini

# UserName
source: Name
ms_my: Nama

# UserNameRequired
source: Please input Name
ms_my: Sila masuk Nama

# WorkDay
source: Working Day
ms_my: Hari Bekerja

source: Flexi Time Interval
ms_my: Sera Masa Flexi (min)

source: Year
ms_my: Tahun

source: Yes
ms_my: Ya

source: Contact No
ms_my: Nombor Telefon

source: Designation
ms_my: Jawatan

# IsResigned
source: Resigned
ms_my: Meletak Jawatan

source: On
ms_my: Pada

source: Personal Profile
ms_my: Profil Peribadi

source: Gender
ms_my: Jantina

source: Female
ms_my: Perempuan

source: Male
ms_my: Lelaki

# OrganisationName
source: Organisation
ms_my: Nama Organisasi

# OrganisationNameRequired
source: Please input Organisation
ms_my: Sila masuk Organisasi

source: Invalid NRIC
ms_my: No Kad Pengenalan tidah sah

source: User
ms_my: Pengguna

source: User List
ms_my: Senarai Pengguna

source: Delete Password
ms_my: Padam Kata Laluan

# MessageSuccessDeletePassword
source: Password is successfully deleted
ms_my: Kata laluan telah berjaya dipadam

# PasswordNew
source: New Password
ms_my: Kata Laluan Baru

# PasswordNewRequired
source: Please input New Password
ms_my: Sila masuk Kata Laluan Baru

# PasswordConfirm
source: Retype Password
ms_my: Sahkan Kata Laluan

# PasswordConfirmRequired
source: Please input Retype New Password
ms_my: Sila masuk sahkan Kata Laluan

source: Change Password
ms_my: Tukar Kata Laluan

# InvalidPasswordConfirm
source: Retype New Password is different
ms_my: Sahkan Kata Laluan tidah sama

# MessageSuccessUpdatePassword
source: Password is successfully updated
ms_my: Kata Laluan telah berjaya dikemaskini

# UserAccessControl
source: User Role Control
ms_my: Kawalan Peranan Pengguna

source: Function
ms_my: Fungsi

source: Function Access Allowed
ms_my: Fungsi Dibenarkan akses

source: System
ms_my: Sistem

# DefaultRoleName
source: Default Role
ms_my: Tetapkan Lalai Peranan Pengguna

# DefaultShiftName
source: Default Shift
ms_my: Tetapkan Lalai Waktu Kerja

# ReasonSubmissionPeriod
source: Reason Submisson Period
ms_my: Alasan Hantar Dalam Tempoh

# DefaultRoleNameRequired
source: Please input Default Role
ms_my: Sila masuk Tetapkan Lalai Peranan Pengguna

# DefaultShiftNameRequired
source: Please input Default Shift
ms_my: Sila masuk Tetapkan Lalai Waktu Kerja

source: Organisation Logo
ms_my: Logo Organisasi

# InvalidImageFile
source: Invalid file
ms_my: Jenis fail tidah sah

source: Approve Reason
ms_my: Lulus Alasan

source: Print Report
ms_my: Cetak Laporan

# ApproverName
source: Name
ms_my: Nama

# ApproverNameRequired
source: Please input Approver Name
ms_my: Sila masuk Nama Pelulus

# ApproverNRIC
source: NRIC
ms_my: No Kad Pengenalan

# ApproverNRICRequired
source: Please input Approver NRIC
ms_my: Sila masuk No Kad Pengenalan Pelulus

source: Approver
ms_my: Pelulus

source: Approver List
ms_my: Senarai Pelulus

# RoleType
source: User Role Type
ms_my: Jenis Peranan Pengguna

# RoleTypeRequired
source: Please input User Role Type
ms_my: Sila masuk Jenis Peranan Pengguna

source: Approver Detail
ms_my: Perincian Pelulus

source: Add
ms_my: Tambah

source: Delete User
ms_my: Padam Pengguna

source: Select User
ms_my: Pilih Pengguna

source: Detail
ms_my: Perincian

# ReportAdmin
source: Report Administrator
ms_my: Pentadbir Laporan

# ReportAdminDetail
source: Report Administrator Detail
ms_my: Perincian Pentadbir Laporan

# ReportAdminList
source: Report Administrator List
ms_my: Senarai Pentadbir Laporan

# ReportAdminName
source: Report Administrator Name
ms_my: Nama Pentadbir Laporan

# ReportAdminNRIC
source: Report Administrator NRIC
ms_my: No Kad Pengenalan Pentadbir Laporan

source: Select Department
ms_my: Pilih Bahagian

source: New Shift
ms_my: Waktu Kerja Baru

# Shift
source: Work Hour
ms_my: Waktu Kerja

# ShiftSchedule
source: Work Hour Schedule
ms_my: Jadual Waktu Kerja

# ShiftScheduleList
source: Work Hour List
ms_my: Senarai Jadual Waktu Kerja

# EffectiveOn
source: Start On
ms_my: Bermula Pada

# ChangeShift
source: Change Work Hour
ms_my: Tukar Waktu Kerja

source: Announcement Message
ms_my: Mesej Pengumuman

source: Announcement
ms_my: Pengumuman

source: Announcement List
ms_my: Senarai Pengumuman

# AnnouncementMessageRequired
source: Please input Announcement Message
ms_my: Sila masuk Mesej Pengumuman

source: Announcement ID
ms_my: ID Pengumuman

source: Announced On
ms_my: Diumumkan Pada

# AttendanceDate
source: Date
ms_my: Tarikh

# AttendanceDay
source: Day
ms_my: Hari

# AttendanceStatusID
source: Attendance Status
ms_my: Kod Status Kedatangan

# FirstIn
source: Time In
ms_my: Masa Masuk

# LastOut
source: Time Out
ms_my: Masa Keluar

source: Lateness
ms_my: Lewat

source: Overtime
ms_my: Lebih Masa

# WorkTime
source: Work Hour
ms_my: Jam Bekerja

source: Attendance Individual
ms_my: Kedatangan Individu

source: Generate
ms_my: Jana

# Print
source: Download
ms_my: Muat Turun

# AttendanceStatus.EOT
source: Early Out
ms_my: Balik Awal

# AttendanceStatus.HLY
source: Public Holiday
ms_my: Cuti Umum

# AttendanceStatus.ICP
source: Incomplete
ms_my: Tidak Lengkap

# AttendanceStatus.L/N
source: Late In / Early Out
ms_my: Lewat Masuk / Balik Awal

# AttendanceStatus.LIN
source: Late In
ms_my: Lewat Masuk

# AttendanceStatus.NOR
source: Work Day
ms_my: Hari Bekerja

# AttendanceStatus.NWK
source: Rest Day
ms_my: Hari Rehat

# SubmissionDueDate
source: Reason Submission Due Date
ms_my: Tarikh Akhir Penyampaian Alasan

# TotalAbsent
source: Absent
ms_my: Tidak Hadir

# TotalAttend
source: Attend
ms_my: Hadir

# TotalEarlyOut
source: Early Out
ms_my: Balik Awal

# TotalLateIn
source: Late In
ms_my: Lewat Masuk

# TotalLateInEarlyOut
source: Late In / Early Out
ms_my: Lewat Masuk / Balik Awal

# TotalOnLeave
source: On Leave
ms_my: Cuti

# StatusApproved
source: Approved
ms_my: Lulus

# StatusRejected
source: Rejected
ms_my: Tidak Lulus

# StatusRequestedToAmend
source: Amendment Required
ms_my: Pindaan Diperlu

# StatusSubmitted
source: Processing
ms_my: Dalam Process

# AttendanceStatus.ABS
source: Absent
ms_my: Tidak Hadir

# Hour
source: h
ms_my: j

# AttendanceReasonSubmission
source: Submit Reason
ms_my: Hantar Alasan

source: Remark
ms_my: Catatan

# MessageSuccessSubmitReason
source: Reason is successfully submitted
ms_my: Alasan telah berjaya dihantar

# TotalIncomplete
source: Incomplete
ms_my: Tidak Lengkap

source: Incomplete
ms_my: Tidak Lengkap

source: Organisation Short Name
ms_my: Nama Ringkas Organisasi

source: Attendance
ms_my: Kedatangan

# StatusPending
source: Pending
ms_my: Belum Selesai

source: Approve
ms_my: Lulus

source: Reject
ms_my: Tidak Lulus

# RequestToAmend
source: Require To Amend
ms_my: Pindaan Diperlu

source: Approval Due Date
ms_my: Tarikh Akhir Kelulusan Alasan

source: Received On
ms_my: Terima Pada

source: Submitted On
ms_my: Hantar Pada

source: Reason Approval
ms_my: Kelulusan Alasan

source: Reject Reason
ms_my: Alasan Tidak Lulus

source: Request To Amend Reason
ms_my: Alasan Pindaan Diperlu

source: Organisation
ms_my: Organisasi

source: Device
ms_my: Peranti

# AccessRole
source: Acess Role
ms_my: Peranan Akses

# AccessRoleNameDuplicated
source: Access Role is duplicated
ms_my: Peranan Akses sudah wujuh

source: Access Role List
ms_my: Senarai Peranan Akses

source: Access Role ID
ms_my: ID Peranan Akses

# AccessRoleName
source: Access Role
ms_my: Peranan Akses

source: Assign Device
ms_my: Menetap Peranti

source: Device ID
ms_my: ID Peranti

# DeviceName
source: Device
ms_my: Peranti

source: Select Device
ms_my: Pilih Peranti

source: Assign
ms_my: Menetap

# MessageSuccessAssignDevice
source: Device is successfully assigned
ms_my: Peranti telah berjaya ditetap

# AccessRoleNameRequired
source: Access Role is required
ms_my: Sila masuk Peranan Akses

# DefaultAccessRoleName
source: Default Access Role
ms_my: Tetapkan Lalai Peranan Akses

# DefaultAccessRoleNameRequired
source: Please input Default Access Role
ms_my: Sila masuk Tetapkan Lalai Peranan Akses

source: Import From Device
ms_my: Import Dari Peranti

source: Search
ms_my: Cari

source: Import New User
ms_my: Import Pengguna Baru

# UserExistIn
source: User is existed in
ms_my: Pengguna sudah wujuh di

# UserNotExistIn
source: User is not existed in
ms_my: Pengguna tidak wujuh di

# MessageSuccessImportNewUser
source: New user is successfully imported
ms_my: Pengguna baru telah berjaya diimport

# DepartmentRequired
source: Please input Department
ms_my: Sila masuk Bahagian

# ShiftRequired
source: Please input Shift
ms_my: Sila masuk Shift

# RoleRequired
source: Please input User Role
ms_my: Sila masuk Peranan Pengguna

# MonthYearRequired
source: Please input Month
ms_my: Sila masuk Bulan

# MessageDeleteDenied
source: Data dirujuk oleh rekod lain, tidak dapat dihapus
ms_my: Data dirujuk oleh rekod lain, tidak dapat dipadam

source: Report
ms_my: Laporan

source: Department Attendance History Report
ms_my: Laporan Sejarah Kedatangan Bahagian

source: Individual Attendance History Report
ms_my: Laporan Sejarah Kedatangan Individu

source: Department Attendance Daily Summary
ms_my: Rumusan Kedatangan Harian Bahagian

# TotalAttendCount
source: Total Attend
ms_my: Jumlah Hadir

# TotalAttendPercentage
source: Attend Percentage
ms_my: Peratus Jumlah Hadir

# TotalInCount
source: Total In
ms_my: Jumlah Masuk

# TotalOutCount
source: Total Out
ms_my: Jumlah Keluar

# TotalUserCount
source: Total User
ms_my: Jumlah Bilangan Pegawai

source: User Count
ms_my: Bilangan Pegawai

source: Attend
ms_my: Hadir

source: Attend Percentage
ms_my: Peratus Hadir

source: In
ms_my: Masuk

source: Out
ms_my: Keluar

source: Department User Count Report
ms_my: Laporan Bilangan Pegawai Bahagian

source: Print Carta Pie
ms_my: Cetak Carta Pie

source: Attendance Report
ms_my: Laporan Kedatangan

source: Week
ms_my: Minggu

source: Version
ms_my: Versi

source: Attendance Summary Report
ms_my: Rumusan Laporan Kedatangan

source: Attendance Analysis
ms_my: Laporan Analisis Kedatangan

source: Attendance Statistics
ms_my: Laporan Statistik Kedatangan

source: Total
ms_my: Jumlah

source: Reason Approval Summary
ms_my: Rumusan Kelulusan Alasan

source: Attachment
ms_my: Lampiran

source: Approver Comment
ms_my: Ulasan Pelulus

source: InvalidFile
ms_my: Jenis fail tidah sah

source: Proof
ms_my: Bukti

source: Attached Proof
ms_my: Lampir Bukti

# MaxFileSizeExceeded
source: Maximum File Size has exceeded
ms_my: Melebihi Saiz Fail Maksimum

source: File Size Limit
ms_my: Had Saiz Fail

source: Contact Us
ms_my: Hubungi Kami

source: Website
ms_my: Laman Web

source: Number Of Day
ms_my: Bilangan Hari

# TelephoneNo
source: Tel No
ms_my: No. Tel

# IsOvertimeExtraDevice
source: O/T Device
ms_my: Peranti O/T

# OvertimeDevice
source: O/T Device
ms_my: Peranti O/T

# SelectOvertimeDevice
source: Select O/T Device
ms_my: Pilih Peranti O/T

# OvertimeExtra
source: Overtime
ms_my: Lebih Masa

source: Total Overtime
ms_my: Jumlah Lebih Masa

# OvertimeExtraEnd
source: Time Out
ms_my: Masa Keluar

# OvertimeExtraStart
source: Time In
ms_my: Masa Masuk

source: Work Overtime
ms_my: Kerja Lebih Masa

# AttendanceMonth
source: Month
ms_my: Bulan

source: Attendance Card Status
ms_my: Warna Kad Kedatangan
